<?xml version="1.0"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <id>https://blog.zhougy.top</id>
    <title>Big Ben • Posts by &#34;操作系统&#34; tag</title>
    <link href="https://blog.zhougy.top" />
    <updated>2012-10-09T23:37:26.000Z</updated>
    <category term="javascript" />
    <category term="angular" />
    <category term="操作系统" />
    <category term="arm" />
    <category term="单片机" />
    <category term="machine learning" />
    <category term="deep learning" />
    <category term="Linux" />
    <category term="内存管理" />
    <category term="Markdown" />
    <category term="python" />
    <category term="win32com" />
    <category term="nas" />
    <category term="synology" />
    <category term="USB" />
    <category term="Linux Device Drivers" />
    <category term="uboot" />
    <category term="http" />
    <category term="同步" />
    <category term="算法" />
    <category term="读书笔记" />
    <category term="程序员修炼之道" />
    <category term="c/c++" />
    <category term="capability" />
    <category term="LD_PRELOAD" />
    <category term="UT" />
    <category term="TDD" />
    <category term="C++" />
    <category term="coding" />
    <category term="SELinux" />
    <category term="hexo" />
    <category term="印象笔记" />
    <category term="Obsidian" />
    <category term="Android" />
    <category term="xposed" />
    <category term="GitHub" />
    <category term="中断处理" />
    <category term="群晖" />
    <category term="docker" />
    <category term="ttrss" />
    <category term="rsshub" />
    <category term="wallabag" />
    <category term="unittest" />
    <category term="mockito" />
    <category term="powermock" />
    <category term="QT" />
    <category term="nlp" />
    <category term="vim" />
    <category term="SpaceVim" />
    <category term="tmux" />
    <category term="面向对象" />
    <category term="promise" />
    <category term="mongodb" />
    <category term="Programming" />
    <category term="security" />
    <category term="C++11" />
    <category term="IoT" />
    <category term="broadlink" />
    <category term="domoticz" />
    <category term="UML" />
    <category term="socket" />
    <category term="iptables" />
    <category term="neural network" />
    <category term="mock" />
    <category term="深度学习" />
    <category term="schedule algorithm" />
    <category term="glibc" />
    <category term="gtest" />
    <category term="gmock" />
    <category term="golang" />
    <category term="elf" />
    <category term="软件开发" />
    <category term="设计模式" />
    <entry>
        <id>https://blog.zhougy.top/2012/10/10/CPU%E8%B0%83%E5%BA%A6/</id>
        <title>CPU调度</title>
        <link rel="alternate" href="https://blog.zhougy.top/2012/10/10/CPU%E8%B0%83%E5%BA%A6/"/>
        <content type="html">&lt;div class=&#34;enNote&#34; style title lang xml:lang dir&gt;&lt;div&gt;&lt;span style=&#34;word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;&#34;&gt;&lt;span style=&#34;font-size: 19px;&#34;&gt;1.&amp;#x8BC4;&amp;#x4EF7;&amp;#x51C6;&amp;#x5219;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;&lt;div&gt;CPU&amp;#x4F7F;&amp;#x7528;&amp;#x7387;&amp;#xFF1A;&amp;lt;40% &amp;#x8F7B;&amp;#x8D1F;&amp;#x8377;&amp;#xFF0C;&amp;gt;90% &amp;#x91CD;&amp;#x8D1F;&amp;#x8377;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x541E;&amp;#x5410;&amp;#x91CF;&amp;#xFF1A;&amp;#x4E00;&amp;#x4E2A;&amp;#x65F6;&amp;#x95F4;&amp;#x5355;&amp;#x5143;&amp;#x5185;&amp;#x5904;&amp;#x7406;&amp;#x8FDB;&amp;#x7A0B;&amp;#x7684;&amp;#x6570;&amp;#x91CF;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x5468;&amp;#x8F6C;&amp;#x65F6;&amp;#x95F4;&amp;#xFF1A;&amp;#x8FDB;&amp;#x7A0B;&amp;#x63D0;&amp;#x4EA4;&amp;#x5230;&amp;#x5B8C;&amp;#x6210;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x5305;&amp;#x542B;&amp;#x4E86;&amp;#x7B49;&amp;#x5F85;&amp;#x548C;&amp;#x5904;&amp;#x7406;&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x7B49;&amp;#x5F85;&amp;#x65F6;&amp;#x95F4;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x54CD;&amp;#x5E94;&amp;#x65F6;&amp;#x95F4;&amp;#xFF1A;&amp;#x4ECE;&amp;#x63D0;&amp;#x4EA4;&amp;#x5230;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x54CD;&amp;#x5E94;&amp;#x4E4B;&amp;#x95F4;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x95F4;&amp;#x9694;&lt;/div&gt;&lt;/li&gt;&lt;/ul&gt;&lt;div style=&#34;font-size: 19px;&#34;&gt;&lt;span style=&#34;font-size: 19px;&#34;&gt;2.&amp;#x7B97;&amp;#x6CD5;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;1&amp;#xFF09;&amp;#x5148;&amp;#x5230;&amp;#x5148;&amp;#x670D;&amp;#x52A1;&amp;#xFF08;FCFS&amp;#xFF09;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;&amp;#x6700;&amp;#x666E;&amp;#x901A;&amp;#x7684;&amp;#x4E00;&amp;#x79CD;&amp;#x8C03;&amp;#x5EA6;&amp;#x65B9;&amp;#x6CD5;&amp;#x3002;&amp;#x5B83;&amp;#x662F;&amp;#x975E;&amp;#x62A2;&amp;#x5360;&amp;#x7684;&amp;#xFF0C;&amp;#x800C;&amp;#x4E14;&amp;#x5F80;&amp;#x5F80;&amp;#x4E0D;&amp;#x662F;&amp;#x6700;&amp;#x4F18;&amp;#x7B97;&amp;#x6CD5;&amp;#x3002;&amp;#x56E0;&amp;#x4E3A;&amp;#x5B83;&amp;#x7684;&amp;#x7B49;&amp;#x5F85;&amp;#x65F6;&amp;#x95F4;&amp;#x4F9D;&amp;#x8D56;&amp;#x4E8E;&amp;#x5904;&amp;#x7406;&amp;#x4EFB;&amp;#x52A1;&amp;#x7684;&amp;#x987A;&amp;#x5E8F;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;2&amp;#xFF09;&amp;#x6700;&amp;#x77ED;&amp;#x4F5C;&amp;#x4E1A;&amp;#x4F18;&amp;#x5148;&amp;#xFF08;SJF&amp;#xFF09;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;SJF&amp;#x7B97;&amp;#x6CD5;&amp;#x88AB;&amp;#x8BC1;&amp;#x660E;&amp;#x4E3A;&amp;#x662F;&amp;#x6700;&amp;#x4F73;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x5176;&amp;#x7B49;&amp;#x5F85;&amp;#x65F6;&amp;#x95F4;&amp;#x6700;&amp;#x77ED;&amp;#x3002;&amp;#x4F46;&amp;#x5176;&amp;#x5B9E;&amp;#x73B0;&amp;#x96BE;&amp;#x5EA6;&amp;#x662F;&amp;#x65E0;&amp;#x6CD5;&amp;#x9884;&amp;#x6599;&amp;#x4E0B;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EFB;&amp;#x52A1;&amp;#x7684;&amp;#x5904;&amp;#x7406;&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&amp;#x73B0;&amp;#x5728;&amp;#x6BD4;&amp;#x8F83;&amp;#x5E38;&amp;#x7528;&amp;#x7684;&amp;#x505A;&amp;#x6CD5;&amp;#x662F;&amp;#xFF0C;&amp;#x91C7;&amp;#x7528;&amp;#x4F30;&amp;#x8BA1;&amp;#x7B97;&amp;#x6CD5;&amp;#x6765;&amp;#x9884;&amp;#x6D4B;&amp;#x4E0B;&amp;#x4E00;&amp;#x4E2A;&amp;#x5904;&amp;#x7406;&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#x5F80;&amp;#x5F80;&amp;#x65F6;&amp;#x95F4;&amp;#x8D8A;&amp;#x4E45;&amp;#xFF0C;&amp;#x9884;&amp;#x6D4B;&amp;#x8D8A;&amp;#x51C6;&amp;#x786E;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;SJF&amp;#x8C03;&amp;#x5EA6;&amp;#x7ECF;&amp;#x5E38;&amp;#x7528;&amp;#x4E8E;&amp;#x957F;&amp;#x671F;&amp;#x8C03;&amp;#x5EA6;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;&amp;#x53EF;&amp;#x62A2;&amp;#x5360;&amp;#x5F0F;&amp;#x7684;SJF&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x88AB;&amp;#x79F0;&amp;#x4F5C;&amp;#x6700;&amp;#x77ED;&amp;#x5269;&amp;#x4F59;&amp;#x65F6;&amp;#x95F4;&amp;#x4F18;&amp;#x5148;&amp;#x8C03;&amp;#x5EA6;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;3&amp;#xFF09;&amp;#x4F18;&amp;#x5148;&amp;#x6743;&amp;#x8C03;&amp;#x5EA6;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;SJF&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x7279;&amp;#x6B8A;&amp;#x7684;&amp;#x4F18;&amp;#x5148;&amp;#x6743;&amp;#x8C03;&amp;#x5EA6;&amp;#x7B97;&amp;#x6CD5;&amp;#x3002;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7B97;&amp;#x6CD5;&amp;#x6709;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x5373;&amp;#x65E0;&amp;#x7A77;&amp;#x963B;&amp;#x585E;&amp;#xFF0C;&amp;#x53C8;&amp;#x53EB;&amp;#x9965;&amp;#x997F;&amp;#x3002;&amp;#x56E0;&amp;#x4E3A;&amp;#x5982;&amp;#x679C;&amp;#x4E00;&amp;#x76F4;&amp;#x6709;&amp;#x9AD8;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x4EFB;&amp;#x52A1;&amp;#x6765;&amp;#x62A2;&amp;#x5360;&amp;#x8D44;&amp;#x6E90;&amp;#xFF0C;&amp;#x5219;&amp;#x6709;&amp;#x53EF;&amp;#x80FD;&amp;#x6709;&amp;#x4E00;&amp;#x4E9B;&amp;#x4F4E;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x4EFB;&amp;#x52A1;&amp;#x6C38;&amp;#x8FDC;&amp;#x5F97;&amp;#x4E0D;&amp;#x5230;&amp;#x64CD;&amp;#x4F5C;&amp;#x3002;&amp;#x9965;&amp;#x997F;&amp;#x7684;&amp;#x89E3;&amp;#x51B3;&amp;#x65B9;&amp;#x6848;&amp;#x662F;&amp;#x8001;&amp;#x5316;&amp;#xFF0C;&amp;#x5373;&amp;#x968F;&amp;#x7740;&amp;#x65F6;&amp;#x95F4;&amp;#x7684;&amp;#x63A8;&amp;#x79FB;&amp;#xFF0C;&amp;#x589E;&amp;#x5927;&amp;#x4E00;&amp;#x4E9B;&amp;#x4F4E;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x4EFB;&amp;#x52A1;&amp;#x7684;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;4&amp;#xFF09;&amp;#x8F6E;&amp;#x8F6C;&amp;#x6CD5;&amp;#xFF08;RR&amp;#xFF0C;round-robin&amp;#xFF09;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;&amp;#x8FD9;&amp;#x662F;&amp;#x5C06;CPU&amp;#x5904;&amp;#x7406;&amp;#x65F6;&amp;#x95F4;&amp;#x5206;&amp;#x6210;&amp;#x8BB8;&amp;#x591A;&amp;#x5C0F;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x7247;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x4EFB;&amp;#x52A1;&amp;#x8F6E;&amp;#x6D41;&amp;#x83B7;&amp;#x5F97;CPU&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&amp;#x8FD9;&amp;#x662F;&amp;#x4E13;&amp;#x95E8;&amp;#x4E3A;&amp;#x5206;&amp;#x65F6;&amp;#x7CFB;&amp;#x7EDF;&amp;#x8BBE;&amp;#x8BA1;&amp;#x7684;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x4EFB;&amp;#x52A1;&amp;#x90FD;&amp;#x4F1A;&amp;#x5F97;&amp;#x5230;&amp;#x5904;&amp;#x7406;&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&amp;#x4F46;&amp;#x6BCF;&amp;#x6B21;&amp;#x5207;&amp;#x6362;&amp;#x4EFB;&amp;#x52A1;&amp;#x90FD;&amp;#x4F1A;&amp;#x53C8;&amp;#x4E00;&amp;#x6B21;&amp;#x4E0A;&amp;#x4E0B;&amp;#x6587;&amp;#x5207;&amp;#x6362;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x4F1A;&amp;#x6D88;&amp;#x8017;&amp;#x4E00;&amp;#x5B9A;&amp;#x7684;&amp;#x8D44;&amp;#x6E90;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;5&amp;#xFF09;&amp;#x591A;&amp;#x7EA7;&amp;#x961F;&amp;#x5217;&amp;#x8C03;&amp;#x5EA6;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;&amp;#x8FD9;&amp;#x662F;&amp;#x6307;&amp;#x5C06;&amp;#x6240;&amp;#x6709;&amp;#x4EFB;&amp;#x52A1;&amp;#x5206;&amp;#x6210;&amp;#x82E5;&amp;#x5E72;&amp;#x4E2A;&amp;#x5904;&amp;#x7406;&amp;#x961F;&amp;#x5217;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x961F;&amp;#x5217;&amp;#x53EF;&amp;#x91C7;&amp;#x7528;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x8C03;&amp;#x5EA6;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x961F;&amp;#x5217;&amp;#x4E4B;&amp;#x95F4;&amp;#x53EF;&amp;#x91C7;&amp;#x7528;&amp;#x56FA;&amp;#x5B9A;&amp;#x4F18;&amp;#x5148;&amp;#x6743;&amp;#x53EF;&amp;#x62A2;&amp;#x5360;&amp;#x8C03;&amp;#x5EA6;&amp;#xFF0C;&amp;#x6216;&amp;#x8005;&amp;#x91C7;&amp;#x7528;round-robin&amp;#x8C03;&amp;#x5EA6;&amp;#xFF0C;&amp;#x5373;&amp;#x6240;&amp;#x6709;&amp;#x961F;&amp;#x5217;&amp;#x5206;&amp;#x4EAB;&amp;#x65F6;&amp;#x95F4;&amp;#x7247;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;6&amp;#xFF09;&amp;#x591A;&amp;#x7EA7;&amp;#x53CD;&amp;#x9988;&amp;#x961F;&amp;#x5217;&amp;#x8C03;&amp;#x5EA6;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;&amp;#x8FD9;&amp;#x662F;&amp;#x5F53;&amp;#x4E0B;&amp;#x6700;&amp;#x901A;&amp;#x7528;&amp;#x7684;CPU&amp;#x8C03;&amp;#x5EA6;&amp;#x7B97;&amp;#x6CD5;&amp;#x3002;&amp;#x8FD9;&amp;#x662F;&amp;#x52A0;&amp;#x5F3A;&amp;#x7248;&amp;#x7684;&amp;#x591A;&amp;#x7EA7;&amp;#x961F;&amp;#x5217;&amp;#x8C03;&amp;#x5EA6;&amp;#x3002;&amp;#x4EFB;&amp;#x52A1;&amp;#x53EF;&amp;#x4EE5;&amp;#x5728;&amp;#x961F;&amp;#x5217;&amp;#x4E4B;&amp;#x95F4;&amp;#x79FB;&amp;#x52A8;&amp;#x3002;&amp;#x9700;&amp;#x8981;&amp;#x957F;&amp;#x65F6;&amp;#x95F4;&amp;#x64CD;&amp;#x4F5C;&amp;#x7684;&amp;#x4EFB;&amp;#x52A1;&amp;#xFF0C;&amp;#x4F1A;&amp;#x88AB;&amp;#x8F6C;&amp;#x79FB;&amp;#x5230;&amp;#x4F4E;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x961F;&amp;#x5217;&amp;#xFF1B;&amp;#x7B49;&amp;#x5F85;&amp;#x65F6;&amp;#x95F4;&amp;#x8FC7;&amp;#x957F;&amp;#x7684;&amp;#x4EFB;&amp;#x52A1;&amp;#xFF0C;&amp;#x4F1A;&amp;#x88AB;&amp;#x8F6C;&amp;#x79FB;&amp;#x5230;&amp;#x9AD8;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x961F;&amp;#x5217;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#x8FD9;&amp;#x79CD;&amp;#x8C03;&amp;#x5EA6;&amp;#x7B97;&amp;#x6CD5;&amp;#x53EF;&amp;#x7531;&amp;#x4E0B;&amp;#x5217;&amp;#x53C2;&amp;#x6570;&amp;#x5B9A;&amp;#x4E49;&amp;#xFF1A;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;&lt;div&gt;&amp;#x961F;&amp;#x5217;&amp;#x6570;&amp;#x91CF;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x6BCF;&amp;#x4E2A;&amp;#x961F;&amp;#x5217;&amp;#x7684;&amp;#x8C03;&amp;#x5EA6;&amp;#x7B97;&amp;#x6CD5;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x4EFB;&amp;#x52A1;&amp;#x5347;&amp;#x7EA7;&amp;#x5230;&amp;#x9AD8;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x961F;&amp;#x5217;&amp;#x7684;&amp;#x6761;&amp;#x4EF6;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x4EFB;&amp;#x52A1;&amp;#x964D;&amp;#x7EA7;&amp;#x5230;&amp;#x4F4E;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x961F;&amp;#x5217;&amp;#x7684;&amp;#x6761;&amp;#x4EF6;&lt;/div&gt;&lt;/li&gt;&lt;li&gt;&lt;div&gt;&amp;#x67D0;&amp;#x4E2A;&amp;#x4EFB;&amp;#x52A1;&amp;#x521D;&amp;#x59CB;&amp;#x65F6;&amp;#x8BE5;&amp;#x8FDB;&amp;#x5165;&amp;#x54EA;&amp;#x4E2A;&amp;#x961F;&amp;#x5217; &amp;#xA0; &amp;#xA0;&amp;#xA0;&lt;/div&gt;&lt;/li&gt;&lt;/ul&gt;&lt;div&gt;&lt;span style=&#34;font-size: 19px;&#34;&gt;3.Linux&amp;#x8C03;&amp;#x5EA6;&amp;#x7B97;&amp;#x6CD5; &amp;#xA0;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;Linux assigns higher-priority tasks longer time&amp;#xA0;quanta and lower-priority tasks shorter time quanta.&amp;#xA0; &amp;#xA0;The relationship between&amp;#xA0;priorities and time-slice length is shown in Figure 5.15.&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;Each runqueue contains two priority arrays: &lt;span style=&#34;color: rgb(255, 0, 0);&#34;&gt;active and expired&lt;/span&gt;.The&amp;#xA0;active array contains all tasks with time remaining in their time slices, and the&amp;#xA0;expired array contains all expired tasks.&amp;#xA0;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;img class=&#34;enMedia&#34; src=&#34;/images/CPU&amp;#x8C03;&amp;#x5EA6;/1537084964261&#34; hash=&#34;4a45b19e113f9304c4d71340975806a5&#34; align alt longdesc width height border hspace vspace usemap style=&#34;cursor: default;cursor: default;&#34; title lang xml:lang dir&gt;&lt;/div&gt;&lt;div&gt;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;Each of these priority arrays contains a&amp;#xA0;list of tasks indexed according to priority (Figure 5.16). The scheduler chooses&amp;#xA0;the task with the highest priority from the active array for execution on the&amp;#xA0;CPU.&lt;/div&gt;&lt;div&gt;&lt;img class=&#34;enMedia&#34; src=&#34;/images/CPU&amp;#x8C03;&amp;#x5EA6;/1537084964263&#34; hash=&#34;ec7a08c9c4f9b0cd499b5259e26ee89f&#34; align alt longdesc width height border hspace vspace usemap style=&#34;cursor: default;cursor: default;&#34; title lang xml:lang dir&gt;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;When all tasks have&amp;#xA0;exhausted their time slices (that is, the active array is empty), the two priority&amp;#xA0;arrays are exchanged: the expired array becomes the active array, and vice&amp;#xA0;versa.&lt;/div&gt;&lt;div&gt;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;Real-time tasks are assigned static priorities. All&amp;#xA0;other tasks have dynamic priorities that are based on their nice values plus or&amp;#xA0;minus the value 5. &amp;#x8FD9;&amp;#x4E2A;&amp;#x8981;&amp;#x770B;&amp;#x4EFB;&amp;#x52A1;&amp;#x7684;&amp;#x7B49;&amp;#x5F85;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x7B49;&amp;#x592A;&amp;#x4E45;&amp;#x4E86;&amp;#x5C31;&amp;#x8981;&amp;#x51CF;5&amp;#x4EE5;&amp;#x63D0;&amp;#x9AD8;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#xFF0C;&amp;#x5426;&amp;#x5219;&amp;#x8981;&amp;#x52A0;5&amp;#x964D;&amp;#x4F4E;&amp;#x4F18;&amp;#x5148;&amp;#x7EA7;&amp;#x3002;&lt;/div&gt;&lt;div&gt;&amp;#xA0; &amp;#xA0; &amp;#xA0;A task&amp;#x2019;s dynamic priority is recalculated when the task has exhausted its&amp;#xA0;time quantum and is to be moved to the expired array.&amp;#xA0;Thus, &lt;span style=&#34;color: rgb(255, 70, 53);&#34;&gt;when the two&amp;#xA0;arrays are exchanged, all tasks in the new active array have been assigned new&amp;#xA0;priorities and corresponding time slices.&lt;/span&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;</content>
        <category term="操作系统" />
        <updated>2012-10-09T23:37:26.000Z</updated>
    </entry>
</feed>
