{
    "version": "https://jsonfeed.org/version/1",
    "title": "Big Ben • All posts by \"文学\" category",
    "description": null,
    "home_page_url": "https://blog.zhougy.top",
    "items": [
        {
            "id": "https://blog.zhougy.top/2021/09/29/obsidian_posts/%E4%BB%8E%E8%B4%BE%E7%91%9E%E7%9C%8B%E2%80%9C%E7%97%B4%E2%80%9D/",
            "url": "https://blog.zhougy.top/2021/09/29/obsidian_posts/%E4%BB%8E%E8%B4%BE%E7%91%9E%E7%9C%8B%E2%80%9C%E7%97%B4%E2%80%9D/",
            "title": "从贾瑞看“痴”",
            "date_published": "2021-09-29T14:25:05.885Z",
            "content_html": "<p>红楼梦里面有一个无足轻重的“小人物”，叫贾瑞。他是荣宁两府的远房亲戚。贾瑞的爷爷贾代儒是代字辈的老学究，也就是贾宝玉的爷爷辈。贾代儒终身未取功名，只能在贾家的私塾当个教书先生，带一帮纨绔子弟读书。贾代儒的孙子也就是贾瑞，只能随爷爷做个小助教，越发的没有地位。贾瑞约摸20出头年纪，比起宝玉大不了几岁，论辈分还是个哥哥辈。但论地位，却如何比得上着红袍戴金冠的芊芊公子哥。偏偏这样一个小把戏，却爱上了两府最有势力，又最势利，最狠辣的凤辣子。可想见最后是没什么好果子的。但观其走向灭亡但过程，也是令人不甚唏嘘。</p>\n<p>第一遍读红楼的时候，也没太关注过这个人，只是对风月宝鉴略有印象。然后对贾瑞的印象，也就是个形容猥琐的好色之徒。这次读《蒋勋读红楼》的时候，通过蒋公的解读，才领略到贾瑞的可怜。其实贾瑞能和秦可卿同章去世，作为警幻仙子秦可卿的对照面，又死于风月宝鉴（红楼梦有一个版本就叫《风月宝鉴》）之下，可见曹雪芹在这个人物身上是蕴含了深意的。</p>\n<p>佛教常说贪嗔痴三毒。贪字，嗔字好解，都是不好的意思。贪字为贪念，人如果欲望与现实脱节，就会产生贪念。嗔为嗔怒，因为欲望得不到满足，人就会出离愤怒。贪嗔二字给人带来不好的情绪。偏偏这个痴字不太好解。痴为妄想，执着一念，而抛弃理智，按佛道的观念，应当也是一种不好的情绪。人应当远离。但现今社会倒慢慢提倡这种痴，例如：对一个人忠贞不渝称为痴情，对一件事追求极致称为痴迷。似乎痴字都快成褒义词了。</p>\n<p>贾瑞对王熙凤的用情就可谓痴情。</p>\n<blockquote>\n<p>他们的家世完全不般配，而王熙凤又十分厉害。王熙凤每一次故意戏弄他，他总是一而再再而三地上当。<br>他其实很痴，他被王熙凤骗了一个晚上，寒冬腊月蹲在地上冻了一夜，回去又被他祖父打了一顿。第二天他去找王熙凤的时候，王熙凤立刻抱怨他，说你昨晚怎么没有来，他马上觉得是他自己错了，赶快跟王熙凤再约。</p>\n</blockquote>\n<p>曹雪芹刻画了一个彻头彻尾的呆瓜，被渣女玩弄的过程。最后呆瓜被玩死了。其实贾瑞最后还有救赎的机会。</p>\n<blockquote>\n<p>一个跛足道士要度化他，给他一面“风月宝鉴”镜子，让他不可以看正面，只可以看反面。<br>它的反面是一个骷髅。可是贾瑞觉得骷髅不好看。他翻过镜子的正面一看，王熙凤在里面向他招手，他便“荡悠悠”进镜子里跟她做爱，最后“纵欲而死”。</p>\n</blockquote>\n<p>读者从第三人称的角度很容易看破贾瑞的“痴”。贾瑞是个刚二十岁出头的小伙子，第一次情窦初开，陷入他的女神王熙凤的情网中不能自拔，也是可以理解的。如果他这次有幸能跳出这个”痴“，回归一点理性，他可能也会对自己的不能自拔付之莞尔。只可惜世事没那么多如果。</p>\n<p>佛家说痴字是毒，是要大家放下那份执念。那种不管不顾的感情所带来的美好，只存在于戏剧和文学作品中，或是人们想象里。现实生活中的执念往往都带会给人带来伤害。但如今纷繁尘世，又比曹雪芹时候诱惑更多。要抛去这个痴字谈何容易。毕竟千百年不变的是人性。就好比当下社会的中国家长，在子女教育上就深陷这个“痴”字，尤其是妈妈们。可能女性天生更容易焦虑吧。</p>\n<p>每位家长心目中都有一份痴情，那就是“望子成龙，望女成凤”。中国自古就有这个传统。人说时代变化快。但不变的是家长的“痴”。十几年前不也有一首歌，唱到：</p>\n<blockquote>\n<p>我学学这个<br>学学那个忙得不的了<br>我的烦恼<br>又有谁会知道<br>学的太多学的太杂消化不了<br>爸爸听我说<br>妈妈听我说<br>我喜欢和小朋友蹦蹦跳跳<br>……</p>\n</blockquote>\n<p>可见这自古时代变迁、社会进步，却改变不了人性。家长心中的女神王熙凤，就是希望孩子能金榜题名的梦想。而诸多的教育机构就有利用了这份”痴“，将家长们玩弄在股掌之中。好似王熙凤的狡诈与狠辣。我不知道，贾瑞有没有意识到王熙凤的存心玩弄。我想可能贾瑞偶尔会意识到，但只要王熙凤略施手段，他又相信他还是有机会了。我们现在的家长又何尝不是这样？在报补习班的时候，他们有没有想过，我的孩子能接受得了吗？在孩子出现这样那样的问题时，他们有没想过，是不是我哪里没做好呢？我想家长们的心里可能会时而冒出一些直击灵魂的瞬间，就像风月宝鉴的正面。虽然它能拯救贾瑞的身体和灵魂，但它并不能慰藉贾瑞的执念。虽然有跛足道人想度化贾瑞，但这时候谁也帮不了一个已经陷入“痴”字的人。只有自己能镇定心神，明白判断什么是自己需要的，才能走出这个执念，走出这个“痴”。如果失败了，时间也过去了，人生就这么短短几十年。像贾瑞一样，就再也没机会翻盘了。</p>\n",
            "tags": [
                "红楼梦",
                "教育"
            ]
        }
    ]
}